CSI API ETABS v1
cPierLabel.GetPier Method
 Checks whether the specified Pier Label exists
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPier(
	string Name
)
Function GetPier (
	Name As String
) As Integer
Dim instance As cPierLabel
Dim Name As String
Dim returnValue As Integer
returnValue = instance.GetPier(Name)
int GetPier(
	String^ Name
)
abstract GetPier :
        Name : string -> int
Parameters
Name
Type: System.String
 The name of an existing Pier Label
Return Value
Type: Int32
 Returns zero if the Pier Label exists, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim SemiRigid As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new pier label
    ret = SapModel.PierLabel.SetPier("MyPier")
'check pier label
    ret = SapModel.PierLabel.GetPier("MyPier")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPierLabel Interface
ETABSv1 Namespace